In [1]:
import numpy as np
import pandas as pd

In [2]:
np.set_printoptions(precision=2)

**Считываем данные из файла**

In [3]:
data = pd.read_csv("../../data/beauty.csv", sep=";")

In [4]:
type(data)

pandas.core.frame.DataFrame

**Смотрим на первые 5 строк**

In [5]:
data.head()

    wage  exper  union  goodhlth  black  female  married  service  educ  looks
0   5.73     30      0         1      0       1        1        1    14      4
1   4.28     28      0         1      0       1        1        0    12      3
2   7.96     35      0         1      0       1        0        0    10      4
3  11.57     38      0         1      0       0        1        1    16      3
4  11.42     27      0         1      0       0        1        0    16      3

In [6]:
data.shape

(1260, 10)

**Краткая статистика – info и describe**

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1260 entries, 0 to 1259
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   wage      1260 non-null   float64
 1   exper     1260 non-null   int64
 2   union     1260 non-null   int64
 3   goodhlth  1260 non-null   int64
 4   black     1260 non-null   int64
 5   female    1260 non-null   int64
 6   married   1260 non-null   int64
 7   service   1260 non-null   int64
 8   educ      1260 non-null   int64
 9   looks     1260 non-null   int64
dtypes: float64(1), int64(9)
memory usage: 98.6 KB

In [8]:
data.describe()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
count,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000
mean,6.306690,18.206349,0.272222,0.933333,0.073810,0.346032,0.691270,0.273810,12.563492,3.185714
std,4.660639,11.963485,0.445280,0.249543,0.261564,0.475892,0.462153,0.446089,2.624489,0.684877
min,1.020000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,5.000000,1.000000
25%,3.707500,8.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,12.000000,3.000000
50%,5.300000,15.000000,0.000000,1.000000,0.000000,0.000000,1.000000,0.000000,12.000000,3.000000
75%,7.695000,27.000000,1.000000,1.000000,0.000000,1.000000,1.000000,1.000000,13.000000,4.000000
max,77.720000,48.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,17.000000,5.000000

**Индексация**

In [9]:
data["exper"].head()

0    30
1    28
2    35
3    38
4    27
Name: exper, dtype: int64

**loc и iloc**

In [25]:
data.loc[0:5, "wage"]

0     5.73
1     4.28
2     7.96
3    11.57
4    11.42
5     3.91
Name: wage, dtype: float64

In [11]:
data.iloc[:, 2:4].head()

   union  goodhlth
0      0         1
1      0         1
2      0         1
3      0         1
4      0         1

**Логическая индексация**

In [12]:
data[data["female"] == 1]["wage"].mean(), data[data["female"] == 0]["wage"].mean()

(4.299357798165136, 7.3688228155339734)

In [13]:
data[(data["female"] == 0) & (data["married"] == 1)]["wage"].median(), data[
    (data["female"] == 0) & (data["married"] == 0)
]["wage"].median()

(6.710000000000001, 5.0649999999999995)

**Groupby**

In [49]:
for look in data.groupby("looks"):
    print(i.head())

AttributeError: 'tuple' object has no attribute 'head'

In [35]:
data.union.value_counts()

0    917
1    343
Name: union, dtype: int64

In [58]:
for look, sub_df in data.groupby(["looks", "female"]):
    print(sub_df.wage)

28      8.35
200     3.75
248    10.99
751     7.93
837     5.56
842     7.69
877     2.73
980     2.31
Name: wage, dtype: float64
327     1.65
1126    3.46
1149    1.26
1171    2.25
1213    2.15
Name: wage, dtype: float64
12      5.14
33      8.17
35      9.62
37      7.69
57      6.56
        ...
1130    3.34
1138    1.17
1179    6.41
1236    4.81
1241    5.34
Name: wage, Length: 88, dtype: float64
65      7.14
79      5.73
94      6.73
96      4.35
118     4.37
127     1.92
134     6.59
135     6.73
144     4.53
145     9.10
172     5.77
275     8.21
335     1.92
371     8.24
435     2.27
461     4.05
500     1.98
518     1.95
544     3.34
556     1.98
560     3.92
567     3.96
620     2.88
628     1.98
630     4.87
670     3.46
711     2.26
852     4.00
857     3.37
858     6.41
862     3.75
876     1.96
878     2.63
915     3.75
922     1.98
924     3.37
961     6.67
984     3.75
994     5.77
1100    2.12
1117    2.02
1147    2.07
1153    3.75
1156    2.19
1158    2.47
1162    2.26
1186    1.80
1188    2.00
1195    2.33
1198    5.13
1215    2.40
1225    5.82
1226    1.09
1256    1.68
Name: wage, dtype: float64
3       11.57
4       11.42
6        8.76
13       3.00
16       5.16
        ...
1246     5.39
1249     8.65
1250     4.17
1251     6.81
1252     9.62
Name: wage, Length: 489, dtype: float64
1       4.28
5       3.91
8       5.00
9       3.89
19      7.69
        ...
1254    1.79
1255    1.61
1257    3.29
1258    2.31
1259    1.92
Name: wage, Length: 233, dtype: float64
7        7.69
11       4.03
14       7.99
15       6.01
17      11.54
        ...
1239     4.62
1240     2.40
1243     4.72
1247     5.31
1248    10.58
Name: wage, Length: 228, dtype: float64
0        5.73
2        7.96
10       3.45
18      10.44
50       9.16
        ...
1196     3.57
1220     5.49
1222     3.29
1223     2.88
1227     1.28
Name: wage, Length: 136, dtype: float64
26      14.84
27      19.08
76      23.32
316      3.92
363     10.66
534      3.81
653      7.96
659     12.66
952      4.81
1013     3.61
1017     4.49
Name: wage, dtype: float64
112     6.11
492     2.51
506     4.40
512     5.09
562     4.95
613     3.95
639     2.14
1200    2.07
Name: wage, dtype: float64

In [52]:
for look, sub_df in data.groupby("looks"):
    print(sub_df)

       wage  exper  union  goodhlth  black  female  married  service  educ  \
28     8.35     41      0         0      0       0        1        1    16
200    3.75     36      0         1      0       0        0        0    12
248   10.99     40      0         1      0       0        1        0    12
327    1.65     24      0         1      0       1        0        1    13
751    7.93     39      1         1      0       0        1        0    12
837    5.56     10      0         1      0       0        1        0    13
842    7.69      9      1         0      0       0        1        0    12
877    2.73     41      0         1      0       0        1        0     8
980    2.31     35      1         1      0       0        1        0     5
1126   3.46     26      0         1      0       1        0        1     5
1149   1.26     32      0         1      1       1        0        0     5
1171   2.25     12      0         1      1       1        0        0     5
1213   2.15      6      0         1      0       1        1        1    12

      looks  is_rich  rubbish
28        1        1  17.7960
200       1        0  13.6200
248       1        1  18.9544
327       1        0   8.6040
751       1        1  16.9208
837       1        0   6.3136
842       1        0   7.1864
877       1        0  14.6488
980       1        0  12.4936
1126      1        0  10.2576
1149      1        0  10.9456
1171      1        0   5.1000
1213      1        0   3.1240
      wage  exper  union  goodhlth  black  female  married  service  educ  \
12    5.14     19      0         1      0       0        1        1    17
33    8.17     18      0         1      0       0        1        0    16
35    9.62     37      0         1      0       0        1        0    13
37    7.69     10      1         1      0       0        1        0    13
57    6.56     17      0         1      0       0        1        0    13
...    ...    ...    ...       ...    ...     ...      ...      ...   ...
1225  5.82     20      0         1      0       1        0        1    17
1226  1.09      8      0         1      0       1        1        1    10
1236  4.81     31      0         1      0       0        1        0    12
1241  5.34     20      0         1      0       0        1        0    12
1256  1.68      4      0         1      0       1        1        1    12

      looks  is_rich  rubbish
12        2        0   8.9584
33        2        1  10.3352
35        2        1  17.2272
37        2        0   7.5064
57        2        0   9.1136
...     ...      ...      ...
1225      2        0   9.6592
1226      2        0   3.1704
1236      2        0  12.6136
1241      2        0   9.3904
1256      2        0   2.2208

[142 rows x 12 columns]
       wage  exper  union  goodhlth  black  female  married  service  educ  \
1      4.28     28      0         1      0       1        1        0    12
3     11.57     38      0         1      0       0        1        1    16
4     11.42     27      0         1      0       0        1        0    16
5      3.91     20      0         0      0       1        1        0    12
6      8.76     12      0         1      0       0        1        0    16
...     ...    ...    ...       ...    ...     ...      ...      ...   ...
1254   1.79     20      0         1      0       1        1        1     8
1255   1.61     25      0         1      1       1        0        1    12
1257   3.29     35      0         1      1       1        0        1    12
1258   2.31     15      0         1      1       1        1        1    10
1259   1.92     24      0         0      0       1        0        1    16

      looks  is_rich  rubbish
1         3        0  11.3568
3         3        1  18.6392
4         3        1  15.0352
5         3        0   8.5896
6         3        1   8.7456
...     ...      ...      ...
1254      3        0   7.4024
1255      3        0   8.9016
1257      3        0  13.0424
1258      3        0   6.0936
1259      3        0   8.7552

[722 rows x 12 columns]
       wage  exper  union  goodhlth  black  female  married  service  educ  \
0      5.73     30      0         1      0       1        1        1    14
2      7.96     35      0         1      0       1        0        0    10
7      7.69      5      1         1      0       0        0        0    16
10     3.45      3      0         1      0       1        0        0    12
11     4.03      6      0         1      0       0        1        0    16
...     ...    ...    ...       ...    ...     ...      ...      ...   ...
1239   4.62     10      0         1      0       0        1        0    13
1240   2.40     12      0         1      0       0        0        1    12
1243   4.72      9      1         1      0       0        1        0    13
1247   5.31      3      0         1      0       0        0        0    17
1248  10.58     19      0         1      0       0        0        0    16

      looks  is_rich  rubbish
0         4        0  12.8088
2         4        1  15.6576
7         4        0   5.9064
10        4        0   2.8920
11        4        0   4.1768
...     ...      ...      ...
1239      4        0   5.7872
1240      4        0   5.1840
1243      4        0   5.5232
1247      4        0   3.9336
1248      4        1  12.0048

[364 rows x 12 columns]
       wage  exper  union  goodhlth  black  female  married  service  educ  \
26    14.84     29      0         1      0       0        0        1    13
27    19.08     17      0         1      0       0        0        0    17
76    23.32     15      0         1      0       0        1        1    17
112    6.11      7      0         1      0       1        1        0    12
316    3.92     12      0         1      0       0        1        1    12
363   10.66      8      0         1      0       0        0        0    13
492    2.51      4      0         1      0       1        0        0    12
506    4.40      3      0         1      0       1        0        0    13
512    5.09      7      0         1      0       1        0        0    17
534    3.81      4      0         1      0       0        1        0    12
562    4.95     10      0         1      1       1        0        0    14
613    3.95      2      0         1      0       1        0        0    12
639    2.14     32      0         1      0       1        0        1    16
653    7.96     15      0         1      0       0        1        0    12
659   12.66     22      1         1      0       0        1        0    12
952    4.81      6      0         1      0       0        1        0    16
1013   3.61      6      0         1      0       0        0        0    12
1017   4.49     17      1         1      0       0        1        0    10
1200   2.07      5      1         1      0       1        0        1    12

      looks  is_rich  rubbish
26        5        1  17.5904
27        5        1  16.1248
76        5        1  17.8592
112       5        0   5.6616
316       5        0   6.0352
363       5        1   8.5296
492       5        0   2.6856
506       5        0   3.4240
512       5        0   5.0904
534       5        0   3.4136
562       5        0   5.9720
613       5        0   2.8520
639       5        0  11.4384
653       5        1   9.2576
659       5        1  14.1296
952       5        0   4.6136
1013      5        0   3.9416
1017      5        0   7.9544
1200      5        0   2.7592

In [71]:
data.groupby("looks", as_index=False)[["wage", "married"]].agg("mean")

   looks      wage   married
0      1  4.621538  0.615385
1      2  5.328803  0.711268
2      3  6.504598  0.716066
3      4  6.299341  0.651099
4      5  7.388421  0.421053

SyntaxError: invalid syntax (36382731.py, line 1)

**Сводная таблица**

In [73]:
pd.crosstab(data["female"], data["married"])

married    0    1
female
0        166  658
1        223  213

In [17]:
pd.crosstab(data["female"], data["looks"])

looks   1   2    3    4   5
female
0       8  88  489  228  11
1       5  54  233  136   8

**Добавление столбцов (построение признаков)**

In [80]:
data["is_rich"] = (data["wage"] > data["wage"].quantile(.75)) \
        .astype("int64")

data.is_rich

0       0
1       0
2       1
3       1
4       1
       ..
1255    0
1256    0
1257    0
1258    0
1259    0
Name: is_rich, Length: 1260, dtype: int64

In [78]:
(data["wage"] > data["wage"].quantile(.75)) \
        .astype("int64")

0       0
1       0
2       1
3       1
4       1
       ..
1255    0
1256    0
1257    0
1258    0
1259    0
Name: wage, Length: 1260, dtype: int64

In [18]:
data["is_rich"] = (data["wage"] > data["wage"].quantile(0.75)).astype("int64")

In [19]:
data.head()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks,is_rich
0,5.73,30,0,1,0,1,1,1,14,4,0
1,4.28,28,0,1,0,1,1,0,12,3,0
2,7.96,35,0,1,0,1,0,0,10,4,1
3,11.57,38,0,1,0,0,1,1,16,3,1
4,11.42,27,0,1,0,0,1,0,16,3,1

In [20]:
data["rubbish"] = 0.56 * data["wage"] + 0.32 * data["exper"]

**map и apply**

In [21]:
def string_gender(female):
    return "female" if female else "male"

In [22]:
d = {1: "union", 0: "non-union"}

In [23]:
data["union"].map(d).head()

0    non-union
1    non-union
2    non-union
3    non-union
4    non-union
Name: union, dtype: object

In [24]:
data["female"].apply(lambda female: "female" if female else "male").head()

0    female
1    female
2    female
3      male
4      male
Name: female, dtype: object